# Table of Contents

# Importing Libraries

# Importing Files

# Task Questions
## - Step 4: Wrangle the Data
## - Step 5: Data Quality and Consistency Check
#### 1) Checking for mixed data type
#### 2) Checking for missing values
#### 3) Checking for duplicates
## - Step 6: Combine the Datasets
## - Step 8: Export Data

----

# Importing Libraries

In [1]:
# The analysis libraries

import pandas as pd
import numpy as np
import os

# Importing Files

In [2]:
#path for instacart folder
path=r'C:\Users\princess\Documents\09-2023 Instacart Basket Analysis'

In [3]:
# importing the new customer dataset

df_cust=pd.read_csv(os.path.join(path, 'Data','Original Data','customers.csv'), index_col=False)

In [4]:
#importing the pkl file into a dask dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_updated_2.pkl'))

----

# Task Questions

# Step 4: Wrangle the Data

#### Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [5]:
# checking the dimensions of the orders and products dataframe
ords_prods_merge.shape

(32404859, 24)

In [6]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,price_range,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_prior_orders,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,both,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,both,...,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Frequent customer
2,473747,1,3,3,12,21.0,196,1,1,both,...,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,both,...,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Frequent customer
4,431534,1,5,4,15,28.0,196,1,1,both,...,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,6.367797,Low spender,20.5,Frequent customer

In [7]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   _merge                  category
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  price_range             object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  average_price           float64
 21  spending_flag           object
 22  median_prior_orders     float64
 23  order_frequency_flag    object
dtypes: category(1), float64(4), int64(11), object(8)
memory usage: 5.6+ GB

In [8]:
# I'm going to delete some columns that are not required for the analysis, just so the dataframe size is reduced.

ords_prods_merge.drop(columns=['_merge','busiest_day','average_price','median_prior_orders','aisle_id','busiest_period_of_day'],inplace=True)

In [9]:
#check to see if it worked
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,department_id,prices,price_range,busiest_days,max_order,loyalty_flag,spending_flag,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,7,9.0,Mid-range product,Regularly busy,10,New customer,Low spender,Frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,7,9.0,Mid-range product,Least busy days,10,New customer,Low spender,Frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,7,9.0,Mid-range product,Least busy days,10,New customer,Low spender,Frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,7,9.0,Mid-range product,Least busy days,10,New customer,Low spender,Frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,7,9.0,Mid-range product,Least busy days,10,New customer,Low spender,Frequent customer

In [10]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 18 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  department_id           int64
 11  prices                  float64
 12  price_range             object
 13  busiest_days            object
 14  max_order               int64
 15  loyalty_flag            object
 16  spending_flag           object
 17  order_frequency_flag    object
dtypes: float64(2), int64(10), object(6)
memory usage: 4.3+ GB

In [11]:
# Change types for ords_prods_merge data set to save memory since memory error keeps occuring when merging datasets

# List of column names to convert to category

category_columns = ['product_name', 'price_range', 'busiest_days', 'loyalty_flag', 'spending_flag', 'order_frequency_flag']

In [12]:
# Convert selected object columns to category data type
for column in category_columns:
    ords_prods_merge[column] = ords_prods_merge[column].astype('category')

In [13]:
# Define a list of columns to downcast to 'float' or 'integer' to save memory as well

opm_float_columns = ['days_since_prior_order', 'prices']
opm_int_columns = ['order_id', 'user_id', 'order_number', 'orders_day_of_week',
               'order_hour_of_day', 'product_id', 'add_to_cart_order',
               'reordered', 'department_id', 'max_order']

In [14]:
# Apply the downcasting loop to relevant columns in the ords_prods_merge dataFrame
for column in opm_float_columns:
    if ords_prods_merge[column].dtype == 'float64':
        ords_prods_merge[column] = pd.to_numeric(ords_prods_merge[column], downcast='float')

for column in opm_int_columns:
    if ords_prods_merge[column].dtype == 'int64':
        ords_prods_merge[column] = pd.to_numeric(ords_prods_merge[column], downcast='integer')

In [15]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 18 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float32
 6   product_id              int32
 7   add_to_cart_order       int16
 8   reordered               int8
 9   product_name            category
 10  department_id           int8
 11  prices                  float32
 12  price_range             category
 13  busiest_days            category
 14  max_order               int8
 15  loyalty_flag            category
 16  spending_flag           category
 17  order_frequency_flag    category
dtypes: category(6), float32(2), int16(1), int32(3), int8(6)
memory usage: 1.1 GB

In [16]:
# checking the dimensions of the customers dataframe
df_cust.shape

(206209, 10)

In [17]:
# checking the headings of the customers dataframe
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### At First Glance:

- Surnam needs to be renamed to 'surname'
- First Name needs to be renamed to 'first_name'
- Gender needs to be renamed to 'gender'
- STATE needs to be renamed to 'state'
- Age needs to be renamed to 'age'
- n_dependents needs to be renamed to 'number_of_dependents'
- fame_status needs to be renamed to 'martial_status'
- drop n_dependants as it is not going to add anything for analysis?? 
- user_id can be used to join with ords_prods_merge dataframe

In [18]:
# getting the statistical values of the numerical values of the chart. 
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

The age, user_id, and dependents are getting counted as a numerical value, so I will need to change them to be non-numerical value columns.

#### Renaming Columns

This step is to ensure all the headings look the same.

In [19]:
#renaming columns
df_cust.rename(columns = {'First Name' : 'first_name'},
                inplace = True
               )
df_cust.rename(columns = {'Surnam' : 'surname'},
                inplace = True
               )
df_cust.rename(columns = {'Gender' : 'gender'},
                inplace = True
               )
df_cust.rename(columns = {'Age' : 'age'},
                inplace = True
               )
df_cust.rename(columns = {'STATE' : 'state'},
                inplace = True
               )
df_cust.rename(columns = {'n_dependants' : 'number_of_dependants'}, 
               inplace = True
              )
df_cust.rename(columns = {'fam_status' : 'marital_status'}, 
               inplace = True
              )

In [20]:
df_cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   surname               206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   marital_status        206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [22]:
# Change types for ords_prods_merge data set to save memory since memory error keeps occuring when merging datasets

# List of column names to convert to category

cust_category_columns = ['first_name', 'surname','gender', 'state', 'date_joined', 'marital_status']

In [23]:
# Convert selected object columns to category data type

for column in cust_category_columns:
    df_cust[column] = df_cust[column].astype('category')

In [24]:
# Define a list of columns to downcast to 'float' or 'integer' to save memory as well

cust_int_columns = ['user_id', 'age', 'number_of_dependants', 'income']

In [25]:
# Apply the downcasting loop to relevant columns in the df_cust dataframe

for column in cust_int_columns:
    if df_cust[column].dtype == 'int64':
        df_cust[column] = pd.to_numeric(df_cust[column], downcast='integer')

In [26]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int32
 1   first_name            194950 non-null  category
 2   surname               206209 non-null  category
 3   gender                206209 non-null  category
 4   state                 206209 non-null  category
 5   age                   206209 non-null  int8
 6   date_joined           206209 non-null  category
 7   number_of_dependants  206209 non-null  int8
 8   marital_status        206209 non-null  category
 9   income                206209 non-null  int32
dtypes: category(6), int32(2), int8(2)
memory usage: 3.8 MB

# Step 5: Data Quality and Consistency Check

#### Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

1) Checking for mixed data type
2) Checking for missing values
3) Checking for duplicates

#### 1. Checking for Mixed Data Types

In [27]:
#check data types
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int32
 1   first_name            194950 non-null  category
 2   surname               206209 non-null  category
 3   gender                206209 non-null  category
 4   state                 206209 non-null  category
 5   age                   206209 non-null  int8
 6   date_joined           206209 non-null  category
 7   number_of_dependants  206209 non-null  int8
 8   marital_status        206209 non-null  category
 9   income                206209 non-null  int32
dtypes: category(6), int32(2), int8(2)
memory usage: 3.8 MB

In [28]:
#check for mixed data types
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

The first_name column returns a mixed data type. Let's investigate further as to why this is.

In [29]:
#find NaN value
print(df_cust['first_name'].isna().sum())

11259

The customers' first_name column has 11, 259 nulls! Dropping might be a good idea, since there's so many.

In [30]:
df_cust.drop(columns=['first_name'],inplace=True)

In [31]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

No more mixed data types!!

In [32]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int32
 1   surname               206209 non-null  category
 2   gender                206209 non-null  category
 3   state                 206209 non-null  category
 4   age                   206209 non-null  int8
 5   date_joined           206209 non-null  category
 6   number_of_dependants  206209 non-null  int8
 7   marital_status        206209 non-null  category
 8   income                206209 non-null  int32
dtypes: category(5), int32(2), int8(2)
memory usage: 3.4 MB

#### 2. Check for Missing Values

In [33]:
#checking for nulls

df_cust.isnull().sum()

user_id                 0
surname                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

There are no missing or null values!

#### 3. Check for Duplicates

In [34]:
# check for duplicate values
df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, surname, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

No duplicate values!

# Step 6: Combine the Datasets

#### Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [35]:
#checking data types and columns for ords_prods_merge dataframe
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 18 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float32
 6   product_id              int32
 7   add_to_cart_order       int16
 8   reordered               int8
 9   product_name            category
 10  department_id           int8
 11  prices                  float32
 12  price_range             category
 13  busiest_days            category
 14  max_order               int8
 15  loyalty_flag            category
 16  spending_flag           category
 17  order_frequency_flag    category
dtypes: category(6), float32(2), int16(1), int32(3), int8(6)
memory usage: 1.1 GB

In [36]:
#checking data types and columns for df_cust dataframe
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int32
 1   surname               206209 non-null  category
 2   gender                206209 non-null  category
 3   state                 206209 non-null  category
 4   age                   206209 non-null  int8
 5   date_joined           206209 non-null  category
 6   number_of_dependants  206209 non-null  int8
 7   marital_status        206209 non-null  category
 8   income                206209 non-null  int32
dtypes: category(5), int32(2), int8(2)
memory usage: 3.4 MB

In [37]:
ords_prods_merge.shape

(32404859, 18)

In [38]:
df_cust.shape

(206209, 9)

In [39]:
# Convert 'user_id' columns to a compatible data type
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('int64')
df_cust['user_id'] = df_cust['user_id'].astype('int64')

In [40]:
#checking dtypes of both datasets user_id since this will be what i merge on
print(ords_prods_merge['user_id'].dtype)
print(df_cust['user_id'].dtype)

int64
int64

In [41]:
# Merge the datasets using a join

df_merged = df_cust.merge(ords_prods_merge, on = 'user_id', indicator = True)

In [42]:
df_merged.head()

,user_id,surname,gender,state,age,date_joined,number_of_dependants,marital_status,income,order_id,...,product_name,department_id,prices,price_range,busiest_days,max_order,loyalty_flag,spending_flag,order_frequency_flag,_merge
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2543867,...,Soda,7,9.0,Mid-range product,Busiest days,8,New customer,Low spender,Regular customer,both
1,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,1285508,...,Soda,7,9.0,Mid-range product,Regularly busy,8,New customer,Low spender,Regular customer,both
2,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2578584,...,Soda,7,9.0,Mid-range product,Busiest days,8,New customer,Low spender,Regular customer,both
3,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,423547,...,0% Greek Strained Yogurt,16,12.6,Mid-range product,Regularly busy,8,New customer,Low spender,Regular customer,both
4,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2524893,...,0% Greek Strained Yogurt,16,12.6,Mid-range product,Least busy days,8,New customer,Low spender,Regular customer,both

In [43]:
# Check to see if fully merged
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

Fully merged!

In [44]:
# remove the indicator column
df_merged.drop(columns=['_merge'],inplace=True)

In [45]:
#check to see if it worked 
df_merged.head()

,user_id,surname,gender,state,age,date_joined,number_of_dependants,marital_status,income,order_id,...,reordered,product_name,department_id,prices,price_range,busiest_days,max_order,loyalty_flag,spending_flag,order_frequency_flag
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2543867,...,0,Soda,7,9.0,Mid-range product,Busiest days,8,New customer,Low spender,Regular customer
1,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,1285508,...,1,Soda,7,9.0,Mid-range product,Regularly busy,8,New customer,Low spender,Regular customer
2,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2578584,...,1,Soda,7,9.0,Mid-range product,Busiest days,8,New customer,Low spender,Regular customer
3,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,423547,...,0,0% Greek Strained Yogurt,16,12.6,Mid-range product,Regularly busy,8,New customer,Low spender,Regular customer
4,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2524893,...,1,0% Greek Strained Yogurt,16,12.6,Mid-range product,Least busy days,8,New customer,Low spender,Regular customer

# Step 8: Export Data

#### Export new cleaned ords_prods_merge file

In [46]:
# This is to ensure that the ords_prods_merge file is fully cleaned and has the new data types for easier use

ords_prods_merge.to_pickle(os.path.join(path,'Data','Prepared Data','updated_integer_ords_prods_merge.pkl'))

In [47]:
# This is to ensure that the df_cust file is fully cleaned and has the new data types for easier use

df_cust.to_pickle(os.path.join(path,'Data','Prepared Data','updated_integer_df_cust.pkl'))

#### Export new merged file, ords_prods_cust_merge

In [48]:
# Export new merged dataset

df_merged.to_pickle(os.path.join(path, 'Data','Prepared Data','orders_products_customers_merged.pkl'))